<?php
// +----------------------------------------------------------------------
// | 系统版本 V1.0
// +----------------------------------------------------------------------
// | 2017年04月25日
// +----------------------------------------------------------------------
// | Author: zjk 
// +----------------------------------------------------------------------

// 数据接口
// 应用入口文件

// 检测PHP环境
if(version_compare(PHP_VERSION,'5.3.0','<'))  die('require PHP > 5.3.0 !');

// 开启调试模式 建议开发阶段开启 部署阶段注释或者设为false
define('APP_DEBUG',True);

// 定义应用目录
define('APP_PATH','./Api/');

// 应用api模式
define('APP_MODE','api');

// 引入入口文件
require './Core/index.php';